{
  "_name_or_path": "/public8/lilab/student/rhwang/geneformer/model/my_model/2407021803_42_5_geneformer_DiseaseClassifier_bcc/checkpoint-99",
  "architectures": [
    "BertForBinaryClassification"
  ],
  "attention_probs_dropout_prob": 0.02,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.02,
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 4,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.40.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 25429
}
